MCheli/HeyClawy/sdkconfig.defaults
# HeyClawy - Common SDK configuration defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Heap
CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Task watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# I2C
CONFIG_I2C_ISR_IRAM_SAFE=y

# LVGL (will be configured by board component)
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# BiDi (RTL) support for Hebrew/Arabic text
CONFIG_LV_USE_BIDI=y
CONFIG_LV_BIDI_BASE_DIR_DEF=0

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# Main task stack (LVGL + WebSocket need more)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Console on UART0 (CH342 on SenseCAP, default UART on most boards)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# WebSocket / HTTP
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# ESP-SR: WakeNet wake word detection
# Default model: "Hey Jarvis" — change via menuconfig → ESP Speech Recognition → WakeNet
CONFIG_SR_WN_WN9_JARVIS_TTS=y
# Disable MultiNet (not needed for wake word, saves ~3.8MB flash)
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_NONE=y
